#pragma once

#include "ActorDefinition.h"
#include "Attribute.h"
#include "Components.h"
#include "Container.h"
#include "DataItem.h"
#include "types.h"
#include <nonstd/optional.hpp>

namespace entt {

enum struct InternalRegistryComponentFamily;

template <typename TFamily> struct Family {
  static unsigned long identifier;
  template <typename TComponent> static unsigned long family();
  template <typename TComponent> static unsigned long type();
};

template <typename... TS> struct SparseSet;
template <typename TEntity> struct SparseSet<TEntity> {
  struct Iterator {
    std::vector<TEntity> const *vec;
    std::size_t pos;
    Iterator(std::vector<TEntity> const &, std::size_t);
    Iterator &operator++();
    bool operator==(Iterator const &) const;
    TEntity operator*() const;
  };
  std::vector<TEntity> dense;
  std::vector<TEntity> sparse;
  SparseSet();

  static TEntity in_use();

  void construct(TEntity);
  bool fast(TEntity) const;
  bool has(TEntity) const;
  TEntity get(TEntity);
  Iterator begin() const;
  Iterator end() const;
  std::size_t extent() const;
  std::size_t size() const;

  virtual ~SparseSet();
  virtual void destroy(TEntity);
  virtual void reset();
};

template <typename TEntity, typename TComponent> struct SparseSet<TEntity, TComponent> : SparseSet<TEntity> {
  std::vector<TComponent> components;
  template <typename... PS> TComponent &construct(TEntity t, PS... ps) {
    SparseSet<TEntity>::construct(t);
    components.emplace_back(t, ps...);
    return components.back();
  }
  TComponent const &get(TEntity) const;

  virtual ~SparseSet() override;
  virtual void destroy(TEntity) override;
  virtual void reset() override;
};

template <typename TEntity, typename... PS> struct View {
  struct Iterator {
    std::array<SparseSet<TEntity>, sizeof...(PS)> data;
    std::size_t pos;
    typename SparseSet<TEntity>::Iterator _begin;
    typename SparseSet<TEntity>::Iterator _end;
    Iterator(std::array<SparseSet<TEntity>, sizeof...(PS)>, std::size_t, typename SparseSet<TEntity>::Iterator, typename SparseSet<TEntity>::Iterator);

    bool operator!=(Iterator const &) const;
    bool operator==(Iterator const &) const;
    bool valid() const;
    Iterator &operator++();
    TEntity operator*(Iterator const &)const;
  };

  std::tuple<PS...> data; // 0
  void *unk24;            // 24
  char mem32[16];         // 32

  View(PS...);
  void reset();

  Iterator begin() const;
  Iterator end() const;

  template <typename TComponent> TComponent const &get(TEntity) const;
  template <typename TComponent> TComponent &get(TEntity);
};

template <typename TEntity> struct Registry {
  template <typename TComponent> struct Pool : SparseSet<TEntity, TComponent> {
    std::vector<std::pair<entt::SparseSet<EntityId> *, bool (entt::Registry<EntityId>::*)(EntityId) const>> data;
    Pool();
    template <typename... PS> TComponent &construct(Registry &, TEntity t, PS... ps);

    virtual ~Pool() override;
    virtual void destroy(TEntity) override;
  };
  struct Attachee;
  std::vector<std::unique_ptr<SparseSet<TEntity>>> entset;  // 0
  std::vector<std::unique_ptr<SparseSet<TEntity>>> entset2; // 24
  std::vector<std::unique_ptr<Attachee>> attachees;         // 48
  std::vector<TEntity> entityIds;                           // 72
  void *unk96;                                              // 96
  char mem104[4];                                           // 104

  Registry();

  template <typename TComponent, typename... PS> TComponent &assign(TEntity, PS...);
  template <typename TComponent> SparseSet<TEntity> const &assure();
  EntityId create();
  void destroy(TEntity);
  template <typename Func> void each(Func func) const {
    if (unk96) {
      for (std::size_t i = entityIds.size(); i != 0; --i) {
        EntityId temp{ i - 1 };
        auto id = entityIds[temp];
        EntityId target{ ((std::size_t)id) & 0xFFFFF };
        if (temp == target) func(id);
      }
    } else {
      for (std::size_t i = entityIds.size(); i != 0; --i) {
        auto id = entityIds[i];
        func(id);
      }
    }
  }

  template <typename TComponent> TComponent const &get(TEntity) const;
  template <typename TComponent> bool has(TEntity) const;
  template <typename TComponent> bool mangled(TEntity) const;
  template <typename TComponent> SparseSet<TEntity> const &pool() const;
  template <typename TComponent> bool reset() const;

  bool valid(TEntity) const;
  template <typename... PS> View<TEntity, PS...> view() const;

  ~Registry();
};

} // namespace entt

struct EntityRegistry;
struct EntityRegistryShareable;

struct EntityContext {
  EntityRegistry &reg;
  EntityId id;
  EntityContext(EntityRegistry &, EntityId);
  template <typename TComponent> TComponent const &addComponent();
  template <typename TComponent> TComponent const &getOrAddComponent();
  template <typename TComponent> TComponent const &removeComponent();
  template <typename TComponent> TComponent const *tryGetComponent();

  bool operator!=(EntityContext const &) const;
  bool operator==(EntityContext const &) const;
};

struct EntityContextStackRef : EntityContext {
  EntityContextStackRef(EntityRegistryShareable &, EntityId);
  // getWeakRef

  bool operator!=(EntityContextStackRef const &) const;
  bool operator==(EntityContextStackRef const &) const;
};

struct EntityRegistry {
  template <typename TFlagComponent, typename TActorComponent, typename TActorFlagComponent> struct View {
    EntityRegistry &reg;
    View(EntityRegistry &);
    template <typename Func> void each(Func);
  };

  entt::Registry<EntityId> &ereg;
  EntityRegistry(entt::Registry<EntityId> &);

  bool isValidEntity(EntityContext const &);
  template <typename TComponent> void removeComponentFromAllEntities();
  template <typename TFlagComponent, typename TActorComponent, typename TActorFlagComponent, typename F> void viewEach(F);
};

struct EntityRegistryShareable : EntityRegistry, std::enable_shared_from_this<EntityRegistryShareable> {
  EntityRegistryShareable(entt::Registry<EntityId> &);
  std::weak_ptr<EntityRegistryShareable> getWeakRef();
  ~EntityRegistryShareable();
};

struct EntityRegistryOwned : EntityRegistryShareable {
  entt::Registry<EntityId> real;
  EntityRegistryOwned();
  EntityContextStackRef createEntity();
  void destroyEntity(EntityContextStackRef);
  ~EntityRegistryOwned();
};

struct IEntityRegistryOwner {
  virtual ~IEntityRegistryOwner();
  virtual EntityRegistry &getEntityRegistry() = 0;
};

struct OwnerStorageEntity {
  struct EntityContextOwned {
    EntityRegistryOwned &owned;
    EntityContextStackRef context;
    EntityContextOwned(EntityRegistryOwned &);
    void destroy();
  };

  nonstd::optional<EntityContextOwned> owned;
  OwnerStorageEntity &operator=(OwnerStorageEntity const &);
  EntityContextOwned const &_getStackRef() const;
  EntityContextOwned &_getStackRef();
  bool _hasValue() const;
  void _remake(EntityRegistryOwned &);
  void _reset();
  ~OwnerStorageEntity();
};

struct WeakStorageEntity;

struct EntityRefTraits {
  using ref       = OwnerStorageEntity;
  using ref_value = typename OwnerStorageEntity::EntityContextOwned;
  using weak_ref  = WeakStorageEntity;
};

struct EntityRegistryRefTraits {
  using ref       = OwnerStorageSharePtr<EntityRegistryOwned>;
  using ref_value = EntityRegistry;
  using weak_ref  = WeakStorageSharePtr<EntityRegistryShareable>;
};

struct StackResultStorageEntity {
  nonstd::optional<EntityContextStackRef> ref;

  EntityContextStackRef const &_getStackRef() const;
  EntityContextStackRef &_getStackRef();
  bool _hasValue() const;
};

struct WeakStorageEntity {
  enum struct EmptyInit;
  enum struct VariadicInit;
  WeakRefT<EntityRegistryRefTraits> reft;
  nonstd::optional<EntityId> eid;

  WeakStorageEntity(OwnerStorageEntity const &);
  WeakStorageEntity(StackResultStorageEntity const &);
  WeakStorageEntity(EmptyInit);
  WeakStorageEntity(VariadicInit, EntityContextStackRef const &);

  WeakStorageEntity &operator=(OwnerStorageEntity const &);
  WeakStorageEntity &operator=(StackResultStorageEntity const &);

  bool _isSet() const;
  void _reset();
};

struct alignas(8) ActorTerrainInterlockData {
  enum struct VisibilityState : char {};
  VisibilityState state;                                            // 0
  std::chrono::time_point<std::chrono::system_clock> creation_time; // 8
  bool b16;                                                         // 16
  void setCreationTime();
  void setVisibilityState(VisibilityState);
};

struct RopeSystem;
struct SpatialActorNetworkData;
struct ActorDefinitionDiffList;
struct ActionQueue;
struct SetActorDataPacket;
struct ActorLocation;
struct AddActorPacket;
struct UIProfanityContext;
struct ActorLink;
struct ChangeDimensionPacket;
struct ActorPos;
struct LootTable;
struct DistanceSortedActor;
struct MobEffect;

#define DEF_COMPONENT(name)                                                                                                                                                                            \
  std::unique_ptr<name##Component> m##name;                                                                                                                                                            \
  name##Component &get##name##Component() const

struct alignas(8) Actor {
  enum struct InitializationMethod : char {};
  OwnerPtrT<EntityRefTraits> entityRef;                        // 8
  bool unk32;                                                  // 32
  VariantParameterList vplist;                                 // 40
  DimensionId dim;                                             // 68
  bool in_world;                                               // 140
  void *unk144;                                                // 144
  std::unique_ptr<ActorDefinitionDescriptor> mActorDefinition; // 152
  ActorUniqueID auid;                                          // 160
  std::shared_ptr<RopeSystem> ropeSystem;                      // 168
  Vec2 rot;                                                    // 184
  Vec2 rotInterpolation;                                       // 192
  int swim_amount;                                             // 200
  int unk204;                                                  // 204
  ChunkPos chunk;                                              // 208
  Vec3 pos;                                                    // 216
  int unk236;                                                  // 236
  SynchedActorData data;                                       // 240
  std::unique_ptr<SpatialActorNetworkData> actorNetworkData;   // 272
  Vec3 pos2;                                                   // 280
  int unk296;                                                  // 296
  bool b300;                                                   // 300
  bool b301;                                                   // 301
  bool b302;                                                   // 302
  bool b303;                                                   // 303
  bool b304;                                                   // 304
  Block &blk;                                                  // 312
  int un_free;                                                 // 320
  bool b324;                                                   // 324
  bool b325;                                                   // 325
  Color color;                                                 // 328
  Color color2;                                                // 344
  int unk360;                                                  // 360
  int unk364;                                                  // 364
  int unk368;                                                  // 368
  std::vector<AABB> bbox;                                      // 384
  int unk408;                                                  // 408
  int riding_height;                                           // 412
  int unk416;                                                  // 416
  int unk420;                                                  // 420
  int unk424;                                                  // 424
  int unk428;                                                  // 428
  int unk432;                                                  // 432
  int unk436;                                                  // 436
  int unk440;                                                  // 440
  int unk444;                                                  // 444
  bool stuck_in_web;                                           // 448
  bool immpbile;                                               // 449
  bool in_water;                                               // 450
  bool entered_water;                                          // 451
  bool b452;                                                   // 452
  Vec2 v456;                                                   // 456
  Vec3 v464;                                                   // 464
  Vec3 v476;                                                   // 476
  Vec3 v488;                                                   // 488
  Vec3 v500;                                                   // 500
  Vec3 v512;                                                   // 512
  bool b524;                                                   // 524
  int unk528;                                                  // 528
  int heal_effects;                                            // 532
  int unk536;                                                  // 536
  bool b540;                                                   // 540
  bool maek_hurt;                                              // 541
  bool was_hurt;                                               // 542
  bool b543;                                                   // 543
  bool b544;                                                   // 544
  int fire_count;                                              // 548
  int unk552;                                                  // 552
  int unk556;                                                  // 556
  bool on_magma;                                               // 560
  int unk564;                                                  // 564
  bool b568;                                                   // 568
  bool b569;                                                   // 569
  int unk572;                                                  // 572
  BlockPos bpos;                                               // 576
  int portalEntranceAxis;                                      // 588
  int unk592;                                                  // 592
  std::vector<ActorUniqueID> riders;                           // 600
  std::vector<ActorUniqueID> riderToRemove;                    // 624
  ActorUniqueID ridingActor;                                   // 648
  ActorUniqueID auid656;                                       // 656
  bool inheritRotationWhenRiding;                              // 664
  bool has_rider;                                              // 665
  void *unk672;                                                // 672
  bool b680;                                                   // 680
  bool b681;                                                   // 681
  bool b682;                                                   // 682
  bool b683;                                                   // 683
  bool teleported;                                             // 684
  bool b685;                                                   // 685
  void *unk688;                                                // 688
  Random randSeed;                                             // 696
  ActorUniqueID auid3216;                                      // 3216
  bool b3224;                                                  // 3224
  bool initialized;                                            // 3225
  Level *blocksource;                                          // 3232
  Dimension *dimension;                                        // 3240
  Level *level;                                                // 3248
  bool changed;                                                // 3256
  bool removed;                                                // 3257
  bool global;                                                 // 3258
  bool autonomous;                                             // 3259
  std::unique_ptr<BaseAttributeMap> baseAttributeMap;          // 3264
  DEF_COMPONENT(AddRider);                                     // 3272
  DEF_COMPONENT(Ageable);                                      // 3280
  DEF_COMPONENT(Angry);                                        // 3288
  DEF_COMPONENT(Balloonable);                                  // 3296
  DEF_COMPONENT(Balloon);                                      // 3304
  DEF_COMPONENT(Behavior);                                     // 3312
  DEF_COMPONENT(Breathable);                                   // 3320
  DEF_COMPONENT(Breedable);                                    // 3328
  DEF_COMPONENT(Bribeable);                                    // 3336
  DEF_COMPONENT(Container);                                    // 3344
  DEF_COMPONENT(DamageOverTime);                               // 3352
  DEF_COMPONENT(Explode);                                      // 3360
  DEF_COMPONENT(Tameable);                                     // 3368
  DEF_COMPONENT(LookAt);                                       // 3376
  DEF_COMPONENT(Projectile);                                   // 3384
  DEF_COMPONENT(Teleport);                                     // 3392
  DEF_COMPONENT(MountTaming);                                  // 3340
  DEF_COMPONENT(Timer);                                        // 3408
  DEF_COMPONENT(Rideable);                                     // 3416
  DEF_COMPONENT(Shooter);                                      // 3424
  DEF_COMPONENT(Interact);                                     // 3432
  DEF_COMPONENT(Equippable);                                   // 3440
  DEF_COMPONENT(Healable);                                     // 3448
  DEF_COMPONENT(ScaleByAge);                                   // 3456
  DEF_COMPONENT(TargetNearby);                                 // 3464
  DEF_COMPONENT(Transformation);                               // 3472
  DEF_COMPONENT(Boostable);                                    // 3480
  DEF_COMPONENT(RailMovement);                                 // 3488
  DEF_COMPONENT(DamageSensor);                                 // 3496
  DEF_COMPONENT(Leashable);                                    // 3504
  DEF_COMPONENT(Hopper);                                       // 3512
  DEF_COMPONENT(CommandBlock);                                 // 3520
  DEF_COMPONENT(Nameable);                                     // 3528
  DEF_COMPONENT(RailActivator);                                // 3536
  DEF_COMPONENT(Npc);                                          // 3544
  DEF_COMPONENT(TripodCamera);                                 // 3552
  DEF_COMPONENT(Boss);                                         // 3560
  DEF_COMPONENT(Peek);                                         // 3568
  DEF_COMPONENT(Tradeable);                                    // 3576
  DEF_COMPONENT(AgentCommand);                                 // 3584
  DEF_COMPONENT(Shareable);                                    // 3592
  DEF_COMPONENT(SpawnActor);                                   // 3600
  DEF_COMPONENT(Physics);                                      // 3608
  DEF_COMPONENT(TickWorld);                                    // 3616
  DEF_COMPONENT(Dance);                                        // 3624
  DEF_COMPONENT(Flocking);                                     // 3632
  DEF_COMPONENT(Bucketable);                                   // 3640
  DEF_COMPONENT(Home);                                         // 3648
  DEF_COMPONENT(Insomnia);                                     // 3656
  DEF_COMPONENT(ClientAnimation);                              // 3664
  AABBShapeComponent aabbShape;                                // 3672
  StateVectorComponent stateVector;                            // 3708
  ActorUniqueID targetActor;                                   // 3744
  bool persistent;                                             // 3752
  bool b3753;                                                  // 3753
  float restrictRadius;                                        // 3756
  BlockPos restrictCenter;                                     // 3760
  ActorUniqueID lovePartberId;                                 // 3776
  std::vector<MobEffectInstance> effects;                      // 3784
  bool b3808;                                                  // 3808
  ActorRuntimeID runtimeID;                                    // 3816
  Color hurtColor;                                             // 3824
  bool enforce_rider_rotation_limit;                           // 3840
  std::unique_ptr<ActorDefinitionDiffList> difflist;           // 3848
  bool b3856;                                                  // 3856
  int unk3860;                                                 // 3860
  int unk3864;                                                 // 3864
  std::string s3872;                                           // 3872
  bool b3904;                                                  // 3904
  float unk3908;                                               // 3908
  bool safeToSleepNear;                                        // 3912
  ActorTerrainInterlockData terrainInterlockData;              // 3920
  SimpleContainer armorContainer;                              // 3944 size: 4
  SimpleContainer handContainer;                               // 4232 size: 2
  bool b4512;                                                  // 4512
  std::vector<AABB> aabbs;                                     // 4520
  bool collidable_mob_near;                                    // 4552
  bool collidable_mob;                                         // 4553
  bool chained_damage_effect;                                  // 4554
  bool b4555;                                                  // 4555
  bool b4556;                                                  // 4556
  bool b4557;                                                  // 4557
  bool b4558;                                                  // 4558
  bool b4559;                                                  // 4559
  bool b4560;                                                  // 4560
  bool b4561;                                                  // 4561
  int unk4564;                                                 // 4564
  bool experimental;                                           // 4568
  std::unique_ptr<ActionQueue> action_queue;                   // 4576
  MolangVariableMap varmap;                                    // 4584

  static int DAMAGE_NEARBY_MOBS_DURATION;
  static int TOTAL_AIR_SUPPLY;

  Actor(ActorDefinitionGroup *, ActorDefinitionIdentifier const &);
  Actor(Level &);

  bool operator==(Actor &);

  Vec3 buildForward() const;
  void burn(int, bool);
  Vec3 calcCenterPos() const;
  int calculateAttackDamage(Actor &);
  bool canClimb() const;
  bool canFly() const;
  bool canMate() const;
  bool canOpenContainer(Player &) const;
  void checkEntityOnewayCollision(BlockSource &, BlockPos const &);
  void clearActionQueue();
  void clearRestriction();
  void createBehaviorComponent();
  UpdateEquipPacket createUpdateEquipPacket(int);
  UpdateTradePacket createUpdateTradePacket(int);
  float distanceSqrToBlockPosCenter() const;
  float distanceTo(Actor const &) const;
  float distanceTo(Vec3 const &) const;
  float distanceToSqr(Actor const &) const;
  float distanceToSqr(Vec3 const &) const;
